<a href="https://colab.research.google.com/github/Rusildur/Study/blob/main/Karpov_sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Симулятор SQL

# Загрузка данных в colab

In [ ]:
# Install postgresql server
!sudo apt-get -y -qq update
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start

# Setup a password `postgres` for username `postgres`
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76, <> line 12.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
Selecting previously unselected package cron.
(Reading database ... 124016 files and directories currently installed.)
Preparing to unpack .../00-cron_3.0pl1-128.1ubuntu1.2_amd64.deb ...
Unpacking cron (3.0pl1-128.1ubuntu1.2) ...
Selecting previously unselected package logrotate.
Preparing to unpack .../01-logrotate_3.11.0-0.1ubuntu1_amd64.deb ...
Unpacking logrotate (3.11.0-0.1ubuntu1) ...
Selecting previously unselected package netbase.
Preparing to unpack .../02-netbase_5.4_all.deb ...
Unpacking netbase (5.4) ...
Preparing to unpack .../03-libpq-dev_10.23-0ubuntu0.18.04.1_amd64.deb ...
Unpacking libpq-dev (10.23-0ubuntu0.18.04.1) over (10.22-0ubuntu0.18.04.1) ...
Preparing to unpack .../04-libpq5_10.23-0ubuntu0.18.04.1_amd64.deb ...
Unpacking libpq5:amd64 (10.23-0ubuntu0.18.04.1) over (10.22-0ubuntu0.18.04.1) ...
Selecting previously unselected package postgresql-client-common.
Preparing to unpack .../05-postgresql-client-common_190ubuntu0.1_all.deb ...
Unpacking postgresql-client-common (190ubuntu0.1) ...
Selecting previously unselected package postgresql-client-10.
Preparing to unpack .../06-postgresql-client-10_10.23-0ubuntu0.18.04.1_amd64.deb ...
Unpacking postgresql-client-10 (10.23-0ubuntu0.18.04.1) ...
Selecting previously unselected package ssl-cert.
Preparing to unpack .../07-ssl-cert_1.0.39_all.deb ...
Unpacking ssl-cert (1.0.39) ...
Selecting previously unselected package postgresql-common.
Preparing to unpack .../08-postgresql-common_190ubuntu0.1_all.deb ...
Adding 'diversion of /usr/bin/pg_config to /usr/bin/pg_config.libpq-dev by postgresql-common'
Unpacking postgresql-common (190ubuntu0.1) ...
Selecting previously unselected package postgresql-10.
Preparing to unpack .../09-postgresql-10_10.23-0ubuntu0.18.04.1_amd64.deb ...
Unpacking postgresql-10 (10.23-0ubuntu0.18.04.1) ...
Selecting previously unselected package postgresql.
Preparing to unpack .../10-postgresql_10+190ubuntu0.1_all.deb ...
Unpacking postgresql (10+190ubuntu0.1) ...
Selecting previously unselected package sysstat.
Preparing to unpack .../11-sysstat_11.6.1-1ubuntu0.2_amd64.deb ...
Unpacking sysstat (11.6.1-1ubuntu0.2) ...
Setting up sysstat (11.6.1-1ubuntu0.2) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline

Creating config file /etc/default/sysstat with new version
update-alternatives: using /usr/bin/sar.sysstat to provide /usr/bin/sar (sar) in auto mode
Created symlink /etc/systemd/system/multi-user.target.wants/sysstat.service → /lib/systemd/system/sysstat.service.
Setting up ssl-cert (1.0.39) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Setting up libpq5:amd64 (10.23-0ubuntu0.18.04.1) ...
Setting up cron (3.0pl1-128.1ubuntu1.2) ...
Adding group `crontab' (GID 110) ...
Done.
Created symlink /etc/systemd/system/multi-user.target.wants/cron.service → /lib/systemd/system/cron.service.
update-rc.d: warning: start and stop actions are no longer supported; falling back to defaults
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up logrotate (3.11.0-0.1ubuntu1) ...
Setting up netbase (5.4) ...
Setting up libpq-dev (10.23-0ubuntu0.18.04.1) ...
Setting up postgresql-client-common (190ubuntu0.1) ...
Setting up postgresql-common (190ubuntu0.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Adding user postgres to group ssl-cert

Creating config file /etc/postgresql-common/createcluster.conf with new version
Building PostgreSQL dictionaries from installed myspell/hunspell packages...
Removing obsolete dictionary files:
Created symlink /etc/systemd/system/multi-user.target.wants/postgresql.service → /lib/systemd/system/postgresql.service.
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql-client-10 (10.23-0ubuntu0.18.04.1) ...
update-alternatives: using /usr/share/postgresql/10/man/man1/psql.1.gz to provide /usr/share/man/man1/psql.1.gz (psql.1.gz) in auto mode
Setting up postgresql-10 (10.23-0ubuntu0.18.04.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Creating new PostgreSQL cluster 10/main ...
/usr/lib/postgresql/10/bin/initdb -D /var/lib/postgresql/10/main --auth-local peer --auth-host md5
The files belonging to this database system will be owned by user "postgres".
This user must also own the server process.

The database cluster will be initialized with locale "en_US.UTF-8".
The default database encoding has accordingly been set to "UTF8".
The default text search configuration will be set to "english".

Data page checksums are disabled.

fixing permissions on existing directory /var/lib/postgresql/10/main ... ok
creating subdirectories ... ok
selecting default max_connections ... 100
selecting default shared_buffers ... 128MB
selecting default timezone ... Etc/UTC
selecting dynamic shared memory implementation ... posix
creating configuration files ... ok
running bootstrap script ... ok
performing post-bootstrap initialization ... ok
syncing data to disk ... ok

Success. You can now start the database server using:

    /usr/lib/postgresql/10/bin/pg_ctl -D /var/lib/postgresql/10/main -l logfile start

Ver Cluster Port Status Owner    Data directory              Log file
10  main    5432 down   postgres /var/lib/postgresql/10/main /var/log/postgresql/postgresql-10-main.log
update-alternatives: using /usr/share/postgresql/10/man/man1/postmaster.1.gz to provide /usr/share/man/man1/postmaster.1.gz (postmaster.1.gz) in auto mode
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql (10+190ubuntu0.1) ...
Processing triggers for man-db (2.8.3-2ubuntu0.1) ...
Processing triggers for libc-bin (2.27-3ubuntu1.6) ...
Processing triggers for systemd (237-3ubuntu10.56) ...
 * Starting PostgreSQL 10 database server
   ...done.
ALTER ROLE

In [ ]:
from sqlalchemy import create_engine
con = create_engine('postgresql+psycopg2://postgres:postgres@localhost:5432/postgres')

In [ ]:
!gdown --id 1IRDDidAPLtYAs3oHE4j0MvOtf3i9sHmP   # users
!gdown --id 1VVr9RlStAmmV_yVWlf0tgO78MCxmBwwz   # user_action
!gdown --id 1vV-LEc6Vec8VWMrdiJcffCuZipwV1UQ6   # courier_action
!gdown --id 1Bfb3zZRG16RC_SHgS6hVLIHXlv-ITNhr  # couriers
!gdown --id 1bguBczMBKxtmxCPHszpT74a38a7kwZNa  # products
!gdown --id 1XmZb8mEk3-UWJFgYoMmq9vhFPVTXwD7M  # orders

/usr/local/lib/python3.8/dist-packages/gdown/cli.py:127: FutureWarning: Option `--id` was deprecated in version 4.3.1 and will be removed in 5.0. You don't need to pass it anymore to use a file ID.
  warnings.warn(
Downloading...
From: https://drive.google.com/uc?id=1IRDDidAPLtYAs3oHE4j0MvOtf3i9sHmP
To: /content/users.csv
100% 436k/436k [00:00<00:00, 75.7MB/s]
/usr/local/lib/python3.8/dist-packages/gdown/cli.py:127: FutureWarning: Option `--id` was deprecated in version 4.3.1 and will be removed in 5.0. You don't need to pass it anymore to use a file ID.
  warnings.warn(
Downloading...
From: https://drive.google.com/uc?id=1VVr9RlStAmmV_yVWlf0tgO78MCxmBwwz
To: /content/user_actions.csv
100% 2.51M/2.51M [00:00<00:00, 176MB/s]
/usr/local/lib/python3.8/dist-packages/gdown/cli.py:127: FutureWarning: Option `--id` was deprecated in version 4.3.1 and will be removed in 5.0. You don't need to pass it anymore to use a file ID.
  warnings.warn(
Downloading...
From: https://drive.google.com/uc?id=1vV-LEc6Vec8VWMrdiJcffCuZipwV1UQ6
To: /content/courier_actions.csv
100% 4.73M/4.73M [00:00<00:00, 53.9MB/s]
/usr/local/lib/python3.8/dist-packages/gdown/cli.py:127: FutureWarning: Option `--id` was deprecated in version 4.3.1 and will be removed in 5.0. You don't need to pass it anymore to use a file ID.
  warnings.warn(
Downloading...
From: https://drive.google.com/uc?id=1Bfb3zZRG16RC_SHgS6hVLIHXlv-ITNhr
To: /content/couriers.csv
100% 57.5k/57.5k [00:00<00:00, 58.1MB/s]
/usr/local/lib/python3.8/dist-packages/gdown/cli.py:127: FutureWarning: Option `--id` was deprecated in version 4.3.1 and will be removed in 5.0. You don't need to pass it anymore to use a file ID.
  warnings.warn(
Downloading...
From: https://drive.google.com/uc?id=1bguBczMBKxtmxCPHszpT74a38a7kwZNa
To: /content/products.csv
100% 2.46k/2.46k [00:00<00:00, 3.74MB/s]
/usr/local/lib/python3.8/dist-packages/gdown/cli.py:127: FutureWarning: Option `--id` was deprecated in version 4.3.1 and will be removed in 5.0. You don't need to pass it anymore to use a file ID.
  warnings.warn(
Downloading...
From: https://drive.google.com/uc?id=1XmZb8mEk3-UWJFgYoMmq9vhFPVTXwD7M
To: /content/orders.csv
100% 2.26M/2.26M [00:00<00:00, 13.4MB/s]

In [ ]:
import pandas as pd

In [ ]:
def select(sql):
  return pd.read_sql(sql,con)

### Таблица users

In [ ]:
df = pd.read_csv('/content/users.csv')

In [ ]:
df.head()

   user_id birth_date     sex
0    10597   24/05/91    male
1     4521   21/07/94  female
2     5778   09/01/92    male
3     8636   05/05/97  female
4    15773   16/08/90    male

In [ ]:
df['birth_date'] = pd.to_datetime(df['birth_date'],format='%d/%m/%y')

In [ ]:
df.dtypes

user_id                int64
birth_date    datetime64[ns]
sex                   object
dtype: object

In [ ]:
df.to_sql('users',con,index=False,if_exists='replace')

In [ ]:
sql = '''SELECT *
FROM users
limit 10
'''

In [ ]:
select(sql)

   user_id birth_date     sex
0    10597 1991-05-24    male
1     4521 1994-07-21  female
2     5778 1992-01-09    male
3     8636 1997-05-05  female
4    15773 1990-08-16    male
5     2181 1996-11-20  female
6      837 1992-09-02  female
7      632 1993-01-06    male
8    11407 1994-11-23  female
9     4744 1984-10-28    male

### Таблица user_actions

In [ ]:
df = pd.read_csv('/content/user_actions.csv')

In [ ]:
df.dtypes

user_id      int64
order_id     int64
action      object
time        object
dtype: object

In [ ]:
df.head()

   user_id  order_id        action            time
0        1         1  create_order  24/08/22 01:52
1        2         2  create_order  24/08/22 06:37
2        3         3  create_order  24/08/22 07:35
3        4         4  create_order  24/08/22 10:39
4        5         5  create_order  24/08/22 12:34

In [ ]:
df['time'] = pd.to_datetime(df['time'],format='%d/%m/%y %H:%M')

In [ ]:
df.dtypes

user_id              int64
order_id             int64
action              object
time        datetime64[ns]
dtype: object

In [ ]:
df.to_sql('user_actions',con,index=False,if_exists='replace')

In [ ]:
sql = ''' select * from user_actions
limit 10
'''

In [ ]:
select(sql)

   user_id  order_id        action                time
0        1         1  create_order 2022-08-24 01:52:00
1        2         2  create_order 2022-08-24 06:37:00
2        3         3  create_order 2022-08-24 07:35:00
3        4         4  create_order 2022-08-24 10:39:00
4        5         5  create_order 2022-08-24 12:34:00
5        6         6  create_order 2022-08-24 13:46:00
6        7         7  create_order 2022-08-24 13:59:00
7        8         8  create_order 2022-08-24 14:03:00
8        7         7  cancel_order 2022-08-24 14:06:00
9        9         9  create_order 2022-08-24 14:45:00

### Таблица orders

In [ ]:
df = pd.read_csv('/content/orders.csv')

In [ ]:
df.head()

   order_id   creation_time       product_ids
0         1  24/08/22 01:52          [65, 28]
1         2  24/08/22 06:37  [35, 30, 42, 34]
2         3  24/08/22 07:35      [24, 70, 77]
3         4  24/08/22 10:39      [72, 40, 20]
4         5  24/08/22 12:34              [48]

In [ ]:
df['creation_time'] = pd.to_datetime(df['creation_time'],format='%d/%m/%y %H:%M')

In [ ]:
df.dtypes

order_id                  int64
creation_time    datetime64[ns]
product_ids              object
dtype: object

In [ ]:
df.to_sql('orders',con,index=False,if_exists='replace')

In [ ]:
sql = ''' select * from orders
limit 10
'''

In [ ]:
select(sql)

   order_id       creation_time               product_ids
0         1 2022-08-24 01:52:00                  [65, 28]
1         2 2022-08-24 06:37:00          [35, 30, 42, 34]
2         3 2022-08-24 07:35:00              [24, 70, 77]
3         4 2022-08-24 10:39:00              [72, 40, 20]
4         5 2022-08-24 12:34:00                      [48]
5         6 2022-08-24 13:46:00      [76, 52, 65, 75, 77]
6         7 2022-08-24 13:59:00      [35, 74, 15, 34, 80]
7         8 2022-08-24 14:03:00                      [41]
8         9 2022-08-24 14:45:00  [40, 27, 24, 39, 62, 15]
9        10 2022-08-24 15:09:00                   [3, 78]

###Таблица products

In [ ]:
df = pd.read_csv('/content/products.csv')

In [ ]:
df.head()

   product_id                     name  price
0           1                    сахар    150
1           2  чай зеленый в пакетиках     50
2           3      вода негазированная     80
3           4                  леденцы     46
4           5               кофе 3 в 1     15

In [ ]:
df.dtypes

product_id     int64
name          object
price          int64
dtype: object

In [ ]:
df.to_sql('products',con,index=False,if_exists='replace')

In [ ]:
sql = ''' select * from products
limit 10
'''

In [ ]:
select(sql)

   product_id                     name  price
0           1                    сахар    150
1           2  чай зеленый в пакетиках     50
2           3      вода негазированная     80
3           4                  леденцы     46
4           5               кофе 3 в 1     15
5           6                 сухарики     25
6           7            кофе зерновой    351
7           8                    сушки     30
8           9      чай черный листовой     84
9          10                  семечки     12

###Таблица couriers

In [ ]:
df = pd.read_csv('/content/couriers.csv')

In [ ]:
df.head()

   courier_id birth_date     sex
0           1   11/06/81  female
1           2   27/06/91    male
2           3   04/05/94    male
3           4   02/06/99    male
4           5   22/12/98  female

In [ ]:
df.dtypes

courier_id     int64
birth_date    object
sex           object
dtype: object

In [ ]:
df['birth_date'] = pd.to_datetime(df['birth_date'],format='%d/%m/%y')

In [ ]:
df.dtypes

courier_id             int64
birth_date    datetime64[ns]
sex                   object
dtype: object

In [ ]:
df.to_sql('couriers',con,index=False,if_exists='replace')

In [ ]:
sql = ''' select * from couriers
limit 10
'''

In [ ]:
select(sql)

   courier_id birth_date     sex
0           1 1981-06-11  female
1           2 1991-06-27    male
2           3 1994-05-04    male
3           4 1999-06-02    male
4           5 1998-12-22  female
5           6 1988-09-20  female
6           7 2003-07-09    male
7           8 1992-10-02  female
8           9 1992-05-23    male
9          10 1992-02-13  female

###Таблица courier_actions

In [ ]:
df = pd.read_csv('/content/courier_actions.csv')

In [ ]:
df.head()

   courier_id  order_id         action            time
0          12         1   accept_order  24/08/22 01:52
1          12         1  deliver_order  24/08/22 02:15
2         156         2   accept_order  24/08/22 06:37
3         156         2  deliver_order  24/08/22 06:56
4          49         3   accept_order  24/08/22 07:35

In [ ]:
df.dtypes

courier_id     int64
order_id       int64
action        object
time          object
dtype: object

In [ ]:
df['time'] = pd.to_datetime(df['time'],format='%d/%m/%y %H:%M')

In [ ]:
df.dtypes

courier_id             int64
order_id               int64
action                object
time          datetime64[ns]
dtype: object

In [ ]:
df.to_sql('courier_actions',con,index=False,if_exists='replace')

In [ ]:
sql = ''' select * from courier_actions
limit 10
'''

In [ ]:
select(sql)

   courier_id  order_id         action                time
0          12         1   accept_order 2022-08-24 01:52:00
1          12         1  deliver_order 2022-08-24 02:15:00
2         156         2   accept_order 2022-08-24 06:37:00
3         156         2  deliver_order 2022-08-24 06:56:00
4          49         3   accept_order 2022-08-24 07:35:00
5          49         3  deliver_order 2022-08-24 07:54:00
6         134         4   accept_order 2022-08-24 10:39:00
7         134         4  deliver_order 2022-08-24 10:58:00
8         106         5   accept_order 2022-08-24 12:34:00
9         106         5  deliver_order 2022-08-24 12:59:00

#Теория, подсказки

## порядок написания, порядок выполнения запросов

**Порядок написания запросов**


```
SELECT -- перечисление полей результирующей таблицы
FROM -- указание источника данных
WHERE -- фильтрация данных
GROUP BY -- группировка данных
HAVING -- фильтрация данных после группировки
ORDER BY -- сортировка результирующей таблицы
LIMIT -- ограничение количества выводимых записей
```

**Порядок выполнения запросов**


```
FROM -- указание источника данных
WHERE -- фильтрация данных
GROUP BY -- группировка данных
HAVING -- фильтрация данных после группировки
SELECT -- перечисление полей результирующей таблицы
ORDER BY -- сортировка результирующей таблицы
LIMIT -- ограничение количества выводимых записей
```

## Операции с множеством (UNION, EXCEPT, INTERSECT)

Операция **UNION** объединяет записи из двух запросов в один общий результат (объединение множеств).

Операция **EXCEPT** возвращает все записи, которые есть в первом запросе, но отсутствуют во втором (разница множеств).

Операция **INTERSECT** возвращает все записи, которые есть и в первом, и во втором запросе (пересечение множеств).

При этом по умолчанию эти операции исключают из результата строки-дубликаты. Чтобы дубликаты не исключались из результата, необходимо после имени операции указать ключевое слово ALL.

Они позволяют комбинировать результаты нескольких запросов друг с другом и получать один общий результат. Причём именно комбинировать, а не объединять, как это делают джойны.

Эту разницу важно понимать: в операциях с множествами не происходит совмещения столбцов из двух таблиц — база данных просто отбирает строки из таблиц, удовлетворяющие типу операции, и добавляет их в общий результат.

# 4 урок Where

## 11 задача

In [ ]:
SELECT user_id, order_id, action, time
FROM user_actions
WHERE action = 'cancel_order' AND
      extract(year from time) = 2022 AND
      extract(month from time) = 8 AND
      extract(dow from time) = 3 AND
      extract(hour from time) BETWEEN 12 AND 15 AND
      extract(minute from time) BETWEEN 0 AND 59
ORDER BY time DESC;

SyntaxError: ignored

## 12 задача

In [ ]:
select t.product_id, t.name,
t.price, 
case when t.name in ('сахар', 'сухарики', 'сушки', 'семечки', 
'масло льняное', 'виноград', 'масло оливковое', 
'арбуз', 'батон', 'йогурт', 'сливки', 'гречка', 
'овсянка', 'макароны', 'баранина', 'апельсины', 
'бублики', 'хлеб', 'горох', 'сметана', 'рыба копченая', 
'мука', 'шпроты', 'сосиски', 'свинина', 'рис', 
'масло кунжутное', 'сгущенка', 'ананас', 'говядина', 
'соль', 'рыба вяленая', 'масло подсолнечное', 'яблоки', 
'груши', 'лепешка', 'молоко', 'курица', 'лаваш', 'вафли', 'мандарины') then round(t.price/110* 10, 2)
else round(t.price/120 * 20, 2) end as tax,
case when t.name in ('сахар', 'сухарики', 'сушки', 'семечки', 
'масло льняное', 'виноград', 'масло оливковое', 
'арбуз', 'батон', 'йогурт', 'сливки', 'гречка', 
'овсянка', 'макароны', 'баранина', 'апельсины', 
'бублики', 'хлеб', 'горох', 'сметана', 'рыба копченая', 
'мука', 'шпроты', 'сосиски', 'свинина', 'рис', 
'масло кунжутное', 'сгущенка', 'ананас', 'говядина', 
'соль', 'рыба вяленая', 'масло подсолнечное', 'яблоки', 
'груши', 'лепешка', 'молоко', 'курица', 'лаваш', 'вафли', 'мандарины') then round(t.price/110* 100, 2)
else round(t.price/120 * 100, 2) end as price_before_tax
from products t
order by price_before_tax DESC, t.product_id

# 5 урок агрегация

## 1 задача

In [ ]:
select distinct t.user_id
from user_actions t 
order by t.user_id

## 2 задача

In [ ]:
select distinct t.courier_id, t.order_id

from courier_actions t 

order by t.courier_id, t.order_id

## 3 задача

In [ ]:
select 
max(t.price) as max_price,
min(t.price) as min_price
from products t

## 4 задача

In [ ]:
select 
count(distinct t.user_id) as unique_users, 
cast(count(distinct t.order_id) as decimal) as unique_orders,
round(cast(count(distinct t.order_id) as decimal) / count(distinct t.user_id), 2) as orders_per_user

from user_actions t

## 5 задача

In [ ]:
select count(courier_id) as couriers_count
from couriers
where sex = 'female'

## 6 задача array_length

In [ ]:
select count(t.order_id) as orders_count
from orders t 
where array_length(t.product_ids, 1) >= 9

## 7 задача

In [ ]:
select round(avg(t.price), 2) as avg_price

from products t 

where (t.name like '%чай%' or t.name like '%кофе%')
and t.name not like '%иван-чай%' and t.name not like '%чайный гриб%'

## 8 задача

In [ ]:
select min(age(current_date,t.birth_date))::varchar as min_age

from couriers t 

where t.sex = 'male'

## 9 задача

In [ ]:
select max(age(t.birth_date)) -  min(age(t.birth_date)) as age_diff

from users t 

where t.sex = 'male'

## 10 задача

In [ ]:
select sum(
case
when t.name in ('сухарики', 'чипсы', 'энергетический напиток') then t.price


else 0
end
) as order_price


from products t

## 11 задача

In [ ]:
select sum(
case
when t.name = 'сухарики'  then t.price * 3
when t.name = 'чипсы' then t.price * 2
when t.name = 'энергетический напиток' then t.price  * 1

else 0 
end
) as order_price


from products t

## 12 задача

In [ ]:
select count(distinct t.user_id) - count( distinct t.user_id) filter(where action like '%cancel%') as users_count

from user_actions t

# 6 урок группировка данных

## 1 задание
С помощью группировки посчитайте количество курьеров мужского и женского пола в таблице couriers. Новую колонку с числом курьером назовите couriers_count. Результат отсортируйте по этой колонке по возрастанию.

Поля в результирующей таблице: sex, couriers_count

In [ ]:
select t.sex, count(t.*) as couriers_count

from couriers t

group by t.sex
order by couriers_count

## 2 задание 

Посчитайте максимальный возраст пользователей мужского и женского пола в таблице users. Возраст измерьте количеством полных лет. Новую колонку с возрастом назовите max_age. Результат отсортируйте по новой колонке по возрастанию возраста.

Поля в результирующей таблице: sex, max_age

In [ ]:
select t.sex, max(date_part('year', age(current_date, t.birth_date))) as max_age
from users t 
group by t.sex
order by max_age

## 3 задание

Разбейте пользователей из таблицы users на группы по возрасту (возраст измеряем количеством полных лет) и посчитайте число пользователей каждого возраста. Колонку с возрастом назовите age, а колонку с числом пользователей — users_count. Отсортируйте полученный результат по возрастанию возраста.

Поля в результирующей таблице: age, users_count

In [ ]:
select 
date_part('year', age(current_date, t.birth_date)) as age, 
count(*) as users_count 

from users t
group by age

order by age

## 4 задание

Вновь разбейте пользователей из таблицы users на группы по возрасту (возраст измеряем количеством полных лет), только теперь добавьте в группировку пол пользователя. В результате в каждой возрастной группе должно появиться ещё по две подгруппы с полом. В каждой такой подгруппе посчитайте число пользователей. Все NULL значения в колонке birth_date заранее отфильтруйте с помощью WHERE. Колонку с возрастом назовите age, а колонку с числом пользователей — users_count, имя колонки с полом оставьте без изменений. Отсортируйте полученную таблицу сначала по колонке с возрастом по возрастанию, затем по колонке с полом — тоже по возрастанию.

Поля в результирующей таблице: age, sex, users_count

In [ ]:
select 
date_part('year', age(current_date, t.birth_date)) as age, 
t.sex, 
count(*) as users_count 

from users t
where t.birth_date is not null
group by age, t.sex
order by age, t.sex

## 5 задание (DATE_TRANC)

Функция DATE_TRUNC используется для усечения дат и времени, т.е. она работает почти как округление ROUND, только для типов данных TIMESTAMP и INTERVAL.

Синтаксис у неё такой же, как и у DATE_PART:

SELECT DATE_TRUNC(part, column)


На месте part в кавычках указывается, до какой точности следует обрезать переданное значение времени:  'year', 'month', 'day', 'hour' и т.д.

Возвращаемое значение имеет тип TIMESTAMP или INTERVAL, а все «части» исходного значения, менее значимые, чем заданная «часть», приравниваются к нулю (или единице, если это номер дня или месяца):

Задание:

Используя функцию DATE_TRUNC, посчитайте, сколько заказов было сделано и сколько было отменено в каждом месяце. Расчёты проводите по таблице user_actions. Колонку с усечённой датой назовите month, колонку с количеством заказов — orders_count. Результат отсортируйте сначала по месяцам — по возрастанию, затем по типу действия — тоже по возрастанию.

Поля в результирующей таблице: month, action, orders_count

In [ ]:
select date_trunc('month', time) as month, 
t.action, count(*) as orders_count

from user_actions t 
group by t.action, month 
order by month, t.action

## 6 задание (снова array_length)

Посчитайте количество товаров в каждом заказе из таблицы orders, примените к этим значениям группировку и посчитайте количество заказов в каждой группе. Выведите две колонки: количество товаров в заказе и число заказов с таким количеством. Колонки назовите соответственно order_size и orders_count. Результат отсортируйте по возрастанию числа товаров в заказе.

Поля в результирующей таблице: order_size, orders_count

In [ ]:
select array_length(t.product_ids, 1) as order_size,
count(*) as orders_count

from orders t
group by order_size
order by order_size

## 7 задание (HAVING - фильтрация после группировки)

Важная особенность работы с HAVING: в этом блоке нельзя указывать алиасы расчётных полей из блока SELECT. Дело в том, что в соответствии с порядком выполнения запроса оператор SELECT выполняется после оператора HAVING. Поэтому агрегацию необходимо также указывать и в HAVING.

Дополните предыдущий запрос оператором HAVING и отберите только те размеры заказов, общее число которых превышает 5000. Вновь выведите две колонки: количество товаров в заказе и число заказов с таким количеством. Колонки назовите соответственно order_size и orders_count. Результат отсортируйте по возрастанию числа товаров в заказе.

Поля в результирующей таблице: order_size, orders_count

In [ ]:
select array_length(t.product_ids, 1) as order_size,
count(*) as orders_count

from orders t
group by order_size

HAVING count(*)  > 5000
order by order_size

## 8 задача

Из таблицы courier_actions отберите id трёх курьеров, доставивших в сентябре 2022 года наибольшее количество заказов. Выведите две колонки — id курьера и число доставленных заказов. Колонку с числом доставленных заказов назовите delivered_orders.

Поля в результирующей таблице: courier_id, delivered_orders

In [ ]:
select t.courier_id, 
count(*) as delivered_orders

from  courier_actions t

WHERE action = 'deliver_order' AND
      extract(year from time) = 2022 AND
      extract(month from time) = 9
group by t.courier_id
order by delivered_orders desc
limit 3

## 9 задача

А теперь отберите id только тех курьеров, которые в сентябре 2022 года успели доставить только по одному заказу. Таблица та же — courier_actions. Вновь выведите две колонки — id курьера и число доставленных заказов. Колонку с числом заказов назовите delivered_orders. Результат отсортируйте по возрастанию id курьера.

Поля в результирующей таблице: courier_id, delivered_orders

In [ ]:
select t.courier_id, 
count(*) as delivered_orders

from  courier_actions t

WHERE action = 'deliver_order' AND
      extract(year from time) = 2022 AND
      extract(month from time) = 9 
      
group by t.courier_id

having count(*) = 1

order by t.courier_id

## 10 задача

Из таблицы user_actions отберите пользователей, у которых последний заказ был создан до 1 сентября 2022 года. Выведите только их id, дату создания заказа выводить не нужно. Результат отсортируйте по возрастанию id пользователя.

Поле в результирующей таблице: user_id

In [ ]:
select t.user_id

from  user_actions t

WHERE extract(year from t.time) = 2022 AND
      action = 'create_order'

group by t.user_id
having max(date_part('month', t.time)) < 9
order by t.user_id

In [ ]:
####### another solution
select t.user_id

from  user_actions t

WHERE extract(year from t.time) = 2022 AND
      action = 'create_order'

group by t.user_id
having max(extract(month from t.time)) < 9
order by t.user_id

## 11 задача (снова Filter)

Для каждого пользователя в таблице user_actions посчитайте долю отменённых заказов. Выведите две колонки: id пользователя и рассчитанный показатель. Новую колонку с показателем округлите до двух знаков после запятой и назовите cancel_rate. Результат отсортируйте по возрастанию id пользователя.

Поля в результирующей таблице: user_id, cancel_rate

In [ ]:
select t.user_id,  
round((count(distinct order_id) filter (where t.action = 'cancel_order'))::decimal / count(distinct order_id), 2) as cancel_rate
from user_actions t 

group by t.user_id
order by t.user_id

## 12 задача (CASE, WHERE, GROUP BY)

Разбейте пользователей из таблицы users на 4 возрастные группы:

от 19 до 24 лет;

от 25 до 29 лет;

от 30 до 35 лет;

от 36 до 41 года.


Посчитайте число пользователей, попавших в каждую возрастную группу. Группы назовите соответственно «19-24», «25-29», «30-35», «36-41» (без кавычек). Выведите наименования групп и число пользователей в них. Колонку с наименованием групп назовите group_age, а колонку с числом пользователей — users_count. Отсортируйте полученную таблицу по колонке с наименованием групп по возрастанию.

Поля в результирующей таблице: group_age, users_count

In [ ]:
case 
when date_part('year', age(current_date, t.birth_date)) between '19' and '24' then '19-24'
when date_part('year', age(current_date, t.birth_date)) between '25' and '29' then '25-29'
when date_part('year', age(current_date, t.birth_date)) between '30' and '35' then '30-35'
when date_part('year', age(current_date, t.birth_date)) between '36' and '41' then '36-41'
end as group_age, 

count(*)  as users_count 

from users t
where t.birth_date is not null
group by group_age
order by group_age

In [ ]:
###another solution with 


with t as (select DATE_PART('year', age(birth_date)) as age 
, count(*) as users_count 
from users 
where birth_date IS NOT NULL 
group by age) 
 
select  
    case  
    WHEN age BETWEEN 19 and 24 THEN '19-24' 
    WHEN age BETWEEN 25 and 29 THEN '25-29' 
    WHEN age BETWEEN 30 and 35 THEN '30-35' 
    WHEN age BETWEEN 36 and 41 THEN '36-41' 
    END as group_age 
, sum(users_count) as users_count 
from t 
group by group_age 
order by group_age

# 7 урок подзапросы

Подзапросы могут применяться в следующих частях основного запроса:

в операторе FROM;

в операторе SELECT (если запрос возвращает один столбец с одним значением);

в операторах WHERE и HAVING (если запрос возвращает один столбец с одним или несколькими значениями).

## 1 задача

Используя данные из таблицы user_actions, рассчитайте среднее число заказов всех пользователей нашего сервиса. Для этого сначала в подзапросе посчитайте, сколько заказов сделал каждый пользователь, а затем обратитесь к результату подзапроса в блоке FROM и уже в основном запросе усредните количество заказов по всем пользователям. Полученное среднее число заказов всех пользователей округлите до двух знаков после запятой. Колонку с этим значением назовите orders_avg.

Поле в результирующей таблице: orders_avg

In [ ]:
select round(avg(cnt),2) as orders_avg
from (
select count(t.user_id) as cnt
from user_actions t 
where t.action = 'create_order'
group by t.user_id
) as user_cnt_create_order

## 2 задача '' WITH table_name AS () ''

Повторите запрос из предыдущего задания, но теперь вместо подзапроса используйте оператор WITH и табличное выражение. Условия задачи те же.

Поле в результирующей таблице: orders_avg

In [ ]:
with user_cnt_create_order as (
select count(t.user_id) as cnt
from user_actions t 
where t.action = 'create_order'
group by t.user_id
) 
select round(avg(t.cnt),2) as orders_avg
from user_cnt_create_order t

## 3 задача

Выведите из таблицы products информацию о всех товарах кроме самого дешёвого. Результат отсортируйте по убыванию id товара.

Поля в результирующей таблице: product_id, name, price

In [ ]:
select t.product_id, t.name, t.price
from products t 
where t.price != (select min(n.price) from products n) 
order by t.product_id desc

## 4 Задача

Выведите информацию о товарах в таблице products, цена на которые превышает среднюю цену всех товаров на 20 рублей и более. Результат отсортируйте по убыванию id товара.

Поля в результирующей таблице: product_id, name, price

In [ ]:
select t.product_id, t.name, t.price
from products t 
where t.price > (select avg(n.price) from products n) + 20 
order by t.product_id desc

## 5 задача

Посчитайте количество уникальных клиентов в таблице user_actions, сделавших за последнюю неделю хотя бы один заказ. Полученную колонку со значением назовите users_count. В качестве текущей даты, от которой откладывать неделю, используйте последнюю дату в той же таблице user_actions.

Поле в результирующей таблице: users_count

In [ ]:
select count(distinct t.user_id) as users_count
from user_actions t 
where time between  (select max(time) - interval '1 week' from user_actions) and(select max(time) from user_actions)

In [ ]:
### another solution 
with max_time as (
select 
max(t.time) - interval '1 week' as max_minus_week, 
max(t.time) as max_tm 
from user_actions t)
select count(distinct t.user_id) as users_count
from user_actions t, max_time mt
where t.time between mt.max_minus_week and mt.max_tm

## 6 задача

запомни, что с помощью date можно извлечь дату из значений в колонках где указано также и время в часах, минутах, секундах

С помощью функции AGE() и агрегирующей функции снова рассчитайте возраст самого молодого курьера мужского пола в таблице couriers, но в этот раз в качестве первой даты используйте последнюю дату из таблицы courier_actions. Чтобы получилась именно дата, перед применением функции AGE() переведите посчитанную последнюю дату в формат DATE, как мы делали в этом задании. Возраст курьера измерьте количеством лет, месяцев и дней и переведите его в тип VARCHAR. Полученную колонку со значением возраста назовите min_age.

Поле в результирующей таблице: min_age

In [ ]:
select 
min(
    age((select max(date(ca.time)) from courier_actions ca), t.birth_date)
)::varchar as min_age

from couriers t
where t.sex = 'male'

## 7 задача

Из таблицы user_actions с помощью подзапроса или табличного выражения отберите все заказы, которые не были отменены пользователями. Выведите колонку с id этих заказов. Результат запроса отсортируйте по возрастанию id заказа.

Поле в результирующей таблице: order_id

In [ ]:
with id_cancel_ordering as (
select t.order_id
from user_actions t 
where action = 'cancel_order'
)

select t.order_id
from user_actions t
where t.order_id not in (select ico.order_id from id_cancel_ordering ico)
order by t.order_id

In [ ]:
SELECT 
       DISTINCT order_id  
FROM user_actions
WHERE  order_id NOT IN (SELECT 
        order_id 
    FROM user_actions
    WHERE action = 'cancel_order' 
    ) 
ORDER BY order_id

## 8 задача

Используя данные из таблицы user_actions, рассчитайте, сколько заказов сделал каждый пользователь и отразите это в столбце orders_count. В отдельном столбце orders_avg напротив каждого пользователя укажите среднее число заказов всех пользователей, округлив его до двух знаков после запятой. Также для каждого пользователя посчитайте отклонение числа заказов от среднего значения. Отклонение считайте так: число заказов «минус» округлённое среднее значение. Колонку с отклонением назовите orders_diff. Результат отсортируйте по возрастанию id пользователя.

Поля в результирующей таблице: user_id, orders_count, orders_avg, orders_diff

In [ ]:
with orders_cnt_t as ( select count(t.order_id) as orders_cnt
                        from user_actions t 
                        where action = 'create_order'
                        group by t.user_id
)

select t.user_id,  count(t.order_id) as orders_count, 
(select round(avg(orders_cnt), 2) from orders_cnt_t) as orders_avg, 
count(t.order_id) - (select round( avg(orders_cnt), 2) from orders_cnt_t) as orders_diff

from user_actions t 
where action = 'create_order'
group by t.user_id
order by t.user_id

In [ ]:
with 
orders_cnt_t as ( select count(t.order_id) as orders_cnt
                        from user_actions t 
                        where action = 'create_order'
                        group by t.user_id
),
avg_order_cntt as ( select round(avg(orders_cnt), 2)  as avg_order_cnt
from orders_cnt_t
)

select t.user_id,  count(t.order_id) as orders_count, 
(select avg_order_cnt from avg_order_cntt) as orders_avg, 
count(t.order_id) - (select avg_order_cnt from avg_order_cntt) as orders_diff

from user_actions t
where action = 'create_order'
group by t.user_id
order by t.user_id

## 9 задача

Выведите id и содержимое 100 последних доставленных заказов из таблицы orders. Содержимым заказов считаются списки с id входящих в заказ товаров. Результат отсортируйте по возрастанию id заказа.

Поля в результирующей таблице: order_id, product_ids

In [ ]:
select order_id, product_ids
from orders 
where order_id in (select order_id from courier_actions where action = 'deliver_order' order by time desc limit 100)
order by order_id

## 10 задача

Из таблицы couriers выведите всю информацию о курьерах, которые в сентябре 2022 года доставили 30 и более заказов. Результат отсортируйте по возрастанию id курьера.

Поля в результирующей таблице: courier_id, birth_date, sex

In [ ]:
with cnt_courier_30 as (
        select ca.courier_id, count(*) as cnt
        from courier_actions ca 
        where ca.action = 'deliver_order' and 
        extract(year from ca.time) = 2022 and 
        extract(month from ca.time) = 9 
        group by ca.courier_id
)
select t.courier_id, t.birth_date, t.sex
from couriers t 
where t.courier_id in (select ca.courier_id from cnt_courier_30 ca where cnt >= 30)
order by t.courier_id

## 11 задача

Назначьте скидку 15% на товары, цена которых превышает среднюю цену на все товары на 50 и более рублей, а также скидку 10% на товары, цена которых ниже средней на 50 и более рублей. Цену остальных товаров внутри диапазона (среднее - 50; среднее + 50) оставьте без изменений. При расчёте средней цены, округлите её до двух знаков после запятой.

Выведите информацию о всех товарах с указанием старой и новой цены. Колонку с новой ценой назовите new_price. Результат отсортируйте сначала по убыванию прежней цены в колонке price, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, price, new_price

In [ ]:
with avg_price as (select round(avg(t.price), 2) avg_price from products t )

select p.product_id, p.name, p.price,
CASE 
when p.price >= ap.avg_price + 50 then p.price * 0.85
when p.price <= ap.avg_price - 50 then p.price * 0.9
else p.price
end as new_price 
from avg_price ap, products p 
order by p.price desc, p.product_id

## 12 задача unnest
SELECT unnest(ARRAY['one','two','three'])

Выберите все колонки из таблицы orders, но в качестве последней колонки укажите функцию unnest, применённую к колонке product_ids. Новую колонку назовите product_id. Выведите только первые 100 записей результирующей таблицы. Посмотрите на результат работы функции unnest и постарайтесь разобраться, что произошло с исходной таблицей.

Поля в результирующей таблице: creation_time, order_id, product_ids, product_id

In [ ]:
sql = '''
select t.creation_time, t.order_id, t.product_ids, unnest(ARRAY[product_ids]) as product_id
from orders t
limit 100
'''

In [ ]:
select(sql)

## 13 задача unnest

with list_product_id as (select  unnest(ARRAY[product_ids]) as product_id
from orders t)
select product_id, count(*) as times_purchased
from list_product_id 
group by product_id
order by times_purchased desc
limit 10

In [ ]:
with list_product_id as (select  unnest(ARRAY[product_ids]) as product_id
from orders t)
select product_id, count(*) as times_purchased
from list_product_id 
group by product_id
order by times_purchased desc
limit 10

## 14 задача

Из таблицы orders выведите id и содержимое заказов, которые включают хотя бы один из пяти самых дорогих товаров, доступных в нашем сервисе. Результат отсортируйте по возрастанию id заказа.

Поля в результирующей таблице: order_id, product_ids

Если совсем не получается:

Попробуйте сначала определить 5 самых дорогих товаров, поместите эту таблицу в подзапрос, затем в отдельном подзапросе разверните списки товаров с помощью unnest, а потом уже в этой развёрнутой таблице просто отфильтруйте строки с теми заказами, которые содержат id товаров из списка самых дорогих. Так как в заказ могут войти сразу несколько самых дорогих товаров, проследите за тем, чтобы в результат не попали дубликаты заказов.

In [ ]:
with 
top5_price as (
                select t.product_id as top5
                from products t 
                order by price DESC
                limit 5
                ), 
list_product_id as (
                select order_id, unnest(ARRAY[product_ids]) as product_id
                from orders t
                    ),
id_top5 as (
                select distinct order_id as dis_id
                from list_product_id
                where product_id in (select top5 from top5_price))

select t.order_id, t.product_ids
from orders t
where t.order_id in (select dis_id from id_top5) 
order by t.order_id

## 15 задача DATE_PART, AGE и COALESCE

Посчитайте возраст каждого пользователя в таблице users. Возраст измерьте числом полных лет, как мы делали в прошлых уроках. Возраст считайте относительно последней даты в таблице user_actions. В результат включите колонки с id пользователя и возрастом. Для тех пользователей, у которых в таблице users не указана дата рождения, укажите среднее значение возраста всех остальных пользователей, округлённое до целого числа. Колонку с возрастом назовите age. Результат отсортируйте по возрастанию id пользователя.

Поля в результирующей таблице: user_id, age

In [ ]:
with max_data AS 
	(SELECT max(date(time)) AS max_data
	FROM user_actions ), 
	avg_data AS 
	(SELECT date_part('year', avg(age(md.max_data, u.birth_date))) AS avg_data
	FROM users u, max_data md)
SELECT u.user_id,
		 COALESCE(date_part('year', age(md.max_data, u.birth_date)), ad.avg_data) AS age
FROM users u, max_data md, avg_data ad
ORDER BY  u.user_id

# 8 урок JOIN

## 1 задача INNER JOIN

Объедините таблицы user_actions и users по ключу user_id. В результат включите две колонки с user_id из обеих таблиц. Эти две колонки назовите соответственно user_id_left и user_id_right. Также в результат включите колонки order_id, time, action, sex, birth_date. Отсортируйте получившуюся таблицу по возрастанию id пользователя (в любой из двух колонок с id).

Поля в результирующей таблице: user_id_left, user_id_right,  order_id, time, action, sex, birth_date

In [ ]:
sql = '''select 
ua.user_id as user_id_left,
u.user_id as user_id_right,  
ua.order_id, 
ua.time, 
ua.action, 
u.sex, 
u.birth_date
from user_actions ua 
INNER join 
users u
on u.user_id = ua.user_id
order by ua.user_id'''

In [ ]:
select(sql)

## 2 задача

А теперь попробуйте немного переписать запрос из прошлого задания и посчитать количество уникальных id в объединённой таблице. То есть снова объедините таблицы, но в этот раз просто посчитайте уникальные user_id в одной из колонок с id. Выведите это количество в качестве результата. Колонку с посчитанным значением назовите users_count.

Поле в результирующей таблице: users_count

In [ ]:
select 
count(distinct  ua.user_id) as users_count
from user_actions ua 
INNER join 
users u
on u.user_id = ua.user_id

## 3 задача LEFT JOIN

С помощью LEFT JOIN объедините таблицы user_actions и users по ключу user_id. Обратите внимание на порядок таблиц — слева users_actions, справа users. В результат включите две колонки с user_id из обеих таблиц. Эти две колонки назовите соответственно user_id_left и user_id_right. Также в результат включите колонки order_id, time, action, sex, birth_date. Отсортируйте получившуюся таблицу по возрастанию id пользователя (в колонке из левой таблицы). Добавьте LIMIT 1000.

Поля в результирующей таблице: user_id_left, user_id_right,  order_id, time, action, sex, birth_date

In [ ]:
select ua.user_id as user_id_left, 
u.user_id as user_id_right,
ua.order_id, ua.time, ua.action, 
u.sex, u.birth_date
from user_actions ua 
LEFT JOIN users u 
on ua.user_id = u.user_id 
order by user_id_left
limit 1000

## 4 задача

Теперь снова попробуйте немного переписать запрос из прошлого задания и посчитайте количество уникальных id в колонке user_id, пришедшей из левой таблицы user_actions. Выведите это количество в качестве результата. Колонку с посчитанным значением назовите users_count.

Поле в результирующей таблице: users_count

In [ ]:
select count(distinct ua.user_id ) as users_count
from user_actions ua 
LEFT JOIN users u 
on ua.user_id = u.user_id

## 5 задание

Возьмите запрос из задания 3, где вы объединяли таблицы user_actions и users с помощью LEFT JOIN, добавьте к запросу оператор WHERE и исключите NULL значения в колонке user_id из правой таблицы. Включите в результат все те же колонки и отсортируйте получившуюся таблицу по возрастанию id пользователя в колонке из левой таблицы. Добавьте LIMIT 1000.

Поля в результирующей таблице: user_id_left, user_id_right,  order_id, time, action, sex, birth_date

In [ ]:
select ua.user_id as user_id_left, 
u.user_id as user_id_right,
ua.order_id, ua.time, ua.action, 
u.sex, u.birth_date
from user_actions ua 
LEFT JOIN users u 
on ua.user_id = u.user_id
where u.user_id is not null 
order by user_id_left
limit 1000

## 6 задание

С помощью FULL JOIN объедините по ключу birth_date таблицы, полученные в результате вышеуказанных запросов (то есть объедините друг с другом два подзапроса). В результат включите две колонки с birth_date из обеих таблиц. Эти две колонки назовите соответственно users_birth_date и couriers_birth_date. Также включите в результат колонки с числом пользователей и курьеров — users_count и couriers_count. Отсортируйте получившуюся таблицу сначала по колонке users_birth_date по возрастанию, затем по колонке couriers_birth_date — тоже по возрастанию.

Поля в результирующей таблице: users_birth_date, users_count,  couriers_birth_date, couriers_count

In [ ]:
with users_bitrh_date_cnt as (
SELECT birth_date, COUNT(user_id) AS users_count
FROM users
WHERE birth_date IS NOT NULL
GROUP BY birth_date
), 
couriers_bitrh_date_cn as
(SELECT birth_date, COUNT(courier_id) AS couriers_count
FROM couriers
WHERE birth_date IS NOT NULL
GROUP BY birth_date)

select u.birth_date as users_birth_date, 
u.users_count, 
c.birth_date as couriers_birth_date,
c.couriers_count
from users_bitrh_date_cnt u
FULL JOIN couriers_bitrh_date_cn c 
ON u.birth_date = c.birth_date
order by users_birth_date, couriers_birth_date

## 7 задание UNION, EXPECT, INTERSECT

Операция **UNION** объединяет записи из двух запросов в один общий результат (объединение множеств).

Операция **EXCEPT** возвращает все записи, которые есть в первом запросе, но отсутствуют во втором (разница множеств).

Операция **INTERSECT** возвращает все записи, которые есть и в первом, и во втором запросе (пересечение множеств).

При этом по умолчанию эти операции исключают из результата строки-дубликаты. Чтобы дубликаты не исключались из результата, необходимо после имени операции указать ключевое слово ALL.

Они позволяют комбинировать результаты нескольких запросов друг с другом и получать один общий результат. Причём именно комбинировать, а не объединять, как это делают джойны.

Эту разницу важно понимать: в операциях с множествами не происходит совмещения столбцов из двух таблиц — база данных просто отбирает строки из таблиц, удовлетворяющие типу операции, и добавляет их в общий результат.

In [ ]:
WITH cnt AS (
SELECT birth_date
FROM users
WHERE birth_date IS NOT NULL
UNION 
SELECT birth_date
FROM couriers
WHERE birth_date IS NOT NULL)
select count(*)  as dates_count
from cnt

## 8 задание CROSS JOIN

Из таблицы users отберите id первых 100 пользователей (просто выберите первые 100 записей, используя простой LIMIT) и с помощью CROSS JOIN объедините их со всеми наименованиями товаров из таблицы products. Выведите две колонки — id пользователя и наименование товара. Результат отсортируйте сначала по возрастанию id пользователя, затем по имени товара — тоже по возрастанию.

Поля в результирующей таблице: user_id, name

In [ ]:
with
top_100_user_ids as 
(select u.user_id from users u 
limit 100)
select 
    top100.user_id, 
    p.name 
from top_100_user_ids top100 
CROSS JOIN products p 
order by top100.user_id, p.name

## 9 задание

Для начала объедините таблицы user_actions и orders — это вы уже умеете делать. В качестве ключа используйте поле order_id. Выведите id пользователей и заказов, а также список товаров в заказе. Отсортируйте таблицу по id пользователя по возрастанию, затем по id заказа — тоже по возрастанию. Добавьте LIMIT 1000.

Поля в результирующей таблице: user_id, order_id, product_ids

In [ ]:
select ua.user_id, ua.order_id, o.product_ids
from user_actions ua 
LEFT JOIN orders o 
on ua.order_id = o.order_id
order by ua.user_id, ua.order_id
limit 1000

## 10 задание

Снова объедините таблицы user_actions и orders, но теперь оставьте только уникальные неотменённые заказы (мы делали похожий запрос на прошлом уроке). Остальные условия задачи те же: вывести id пользователей и заказов, а также список товаров в заказе. Отсортируйте таблицу по id пользователя по возрастанию, затем по id заказа — тоже по возрастанию. Добавьте LIMIT 1000.

Поля в результирующей таблице: user_id, order_id, product_ids

In [ ]:
### решение с фильтрацией после джойна таблиц 
select ua.user_id, ua.order_id, o.product_ids
from user_actions ua 
LEFT JOIN orders o 
on ua.order_id = o.order_id

where ua.order_id not in (
SELECT order_id 
    FROM user_actions
    WHERE action = 'cancel_order' )
order by ua.user_id, ua.order_id
limit 1000

In [ ]:
### решение с фильтрацией до джойна таблиц
with
user_action_without_cancel_orders as (
select ua.action, ua.order_id, ua.time, ua.user_id
from user_actions ua 
where ua.order_id not in (
                        SELECT order_id 
                        FROM user_actions
                        WHERE action = 'cancel_order'
                        )

                                    )

select ua.user_id, ua.order_id, o.product_ids
from user_action_without_cancel_orders ua 
LEFT JOIN orders o 
on ua.order_id = o.order_id
order by ua.user_id, ua.order_id
limit 1000

## 11 задание

Используя запрос из предыдущего задания, посчитайте, сколько в среднем товаров заказывает каждый пользователь. Выведите id пользователя и среднее количество товаров в заказе. Среднее значение округлите до двух знаков после запятой. Колонку посчитанными значениями назовите avg_order_size. Результат выполнения запроса отсортируйте по возрастанию id пользователя. Добавьте LIMIT 1000.

Поля в результирующей таблице: user_id, avg_order_size

In [ ]:
with
user_action_without_cancel_orders as (
select ua.action, ua.order_id, ua.time, ua.user_id
from user_actions ua 
where ua.order_id not in (
                        SELECT order_id 
                        FROM user_actions
                        WHERE action = 'cancel_order'
                        )

                                    )
select ua.user_id, round(avg(array_length(product_ids, 1)), 2) as avg_order_size
from user_action_without_cancel_orders ua 
LEFT JOIN orders o 
on ua.order_id = o.order_id
group by ua.user_id
order by ua.user_id

limit 1000

## 12 задание

Для начала к таблице с заказами (orders) примените функцию unnest, как мы делали в прошлом уроке. Колонку с id товаров назовите product_id. Затем к образовавшейся расширенной таблице по ключу product_id добавьте информацию о ценах на товары (из таблицы products). Должна получиться таблица с заказами, товарами внутри каждого заказа и ценами на эти товары. Выведите колонки с id заказа, id товара и ценой товара. Результат отсортируйте сначала по возрастанию id заказа, затем по возрастанию id товара. Добавьте LIMIT 1000.

Поля в результирующей таблице: order_id, product_id, price

In [ ]:
with t_product_ids as
(select o.order_id, unnest(array[o.product_ids]) as product_id
from orders o)
select tpi.order_id, tpi.product_id, p.price
from t_product_ids tpi
left join products p
on tpi.product_id = p.product_id
order by tpi.order_id, tpi.product_id
limit 1000

## 13 задача

Используя запрос из предыдущего задания, рассчитайте суммарную стоимость каждого заказа. Выведите колонки с id заказов и их стоимостью. Колонку со стоимостью заказа назовите order_price. Результат отсортируйте по возрастанию id заказа. Добавьте LIMIT 1000.

Поля в результирующей таблице: order_id, order_price

In [ ]:
sql = '''with t_product_ids as
(select o.order_id, unnest(array[o.product_ids]) as product_id
from orders o), 
order_price as (select tpi.order_id, tpi.product_id, p.price
from t_product_ids tpi
left join products p
on tpi.product_id = p.product_id
order by tpi.order_id, tpi.product_id)
select op.order_id, sum(op.price) as order_price
from order_price op 
group by op.order_id
order by op.order_id
limit 1000 '''

In [ ]:
select(sql)

## 14 задача

Объедините запрос из предыдущего задания с частью запроса, который вы составили в задаче 11, то есть объедините запрос со стоимостью заказов с запросом, в котором вы считали размер каждого заказа из таблицы user_actions.

На основе объединённой таблицы для каждого пользователя рассчитайте следующие показатели:

общее число заказов — колонку назовите orders_count
среднее количество товаров в заказе — avg_order_size
суммарную стоимость всех покупок — sum_order_value
среднюю стоимость заказа — avg_order_value
минимальную стоимость заказа — min_order_value
максимальную стоимость заказа — max_order_value
Полученный результат отсортируйте по возрастанию id пользователя. Добавьте LIMIT 1000. Помните, что в расчётах мы по-прежнему учитываем только неотменённые заказы. При расчёте средних значений, округляйте их до двух знаков после запятой.

Поля в результирующей таблице: 

user_id, orders_count, avg_order_size, sum_order_value, avg_order_value, min_order_value, max_order_value

In [ ]:
with t_product_ids as
(select o.order_id, unnest(array[o.product_ids]) as product_id
from orders o), 
order_price as (select tpi.order_id, tpi.product_id, p.price
from t_product_ids tpi
left join products p
on tpi.product_id = p.product_id
order by tpi.order_id, tpi.product_id),
order_id_price as (
select op.order_id, sum(op.price) as order_price
from order_price op 
group by op.order_id), 

user_action_without_cancel_orders as (
select ua.action, ua.order_id, ua.time, ua.user_id
from user_actions ua 
where ua.order_id not in (
                        SELECT order_id 
                        FROM user_actions
                        WHERE action = 'cancel_order'
                        )

                                    ), 
user_id_avg_size as(                                    
select ua.user_id, round(avg(array_length(product_ids, 1)), 2) as avg_order_size
from user_action_without_cancel_orders ua 
LEFT JOIN orders o 
on ua.order_id = o.order_id
group by ua.user_id)
select * from user_id_avg_size

In [ ]:
sql = '''
WITH t AS 
(SELECT  user_id 
        , order_id 
        , unnest(product_ids) AS product_id 
FROM    orders 
JOIN    user_actions USING(order_id) 
WHERE   order_id NOT IN (SELECT order_id FROM user_actions WHERE action = 'cancel_order') 
), 
t2 AS 
(SELECT  user_id 
        , order_id 
        , SUM(price) AS order_price 
FROM    t 
JOIN    products AS p 
USING(product_id) 
GROUP BY user_id, order_id), 
 t3 AS 
(SELECT  user_id 
        , order_id 
        , order_price 
        , array_length(product_ids, 1) AS len 
FROM    t2 JOIN orders USING(order_id) 
)         
SELECT  user_id 
        , COUNT(order_id) AS orders_count 
        , ROUND(AVG(len), 2) AS avg_order_size 
        , SUM(order_price) AS sum_order_value 
        , ROUND(AVG(order_price), 2) AS avg_order_value 
        , MIN(order_price) AS min_order_value 
        , MAX(order_price) AS max_order_value 
FROM    t3  
GROUP BY user_id 
ORDER BY user_id 
LIMIT   1000
'''

In [ ]:
select(sql)

##15 задача

По таблицам orders и products определите 10 самых популярных товаров. Самыми популярными товарами будем считать те, которые встречались в заказах чаще всего. Если товар встречается в одном заказе несколько раз (было куплено несколько единиц товара), то при подсчёте учитываем только одну единицу товара. Выведите наименования товаров и сколько раз они встречались в заказах. Новую колонку с количеством покупок товара назовите times_purchased. Обратите внимание, мы не учитываем товары из отмененных заказов!

Поля в результирующей таблице: name, times_purchased

In [ ]:
with t1 as (
select o.order_id, unnest(array[o.product_ids]) as prod_id
from orders o 
where o.order_id not in (
                        select order_id
                        from user_actions 
                        where action = 'cancel_order'
                        )
            ),
t2 as (select t.prod_id, count(t.order_id) as cnt0, count( distinct t.order_id) as cnt1
from t1 t
group by t.prod_id
order by cnt1 desc)
select p.name,  t.cnt1 as times_purchased
from t2 t
left join products p 
on t.prod_id = p.product_id
limit 10

##16 задача

Возьмите запрос, составленный на одном из прошлых уроков, и подтяните в него из таблицы users данные о поле пользователей, таким образом, чтобы все пользователи из таблицы users_actions остались в результате. Затем посчитайте среднее значение cancel_rate для каждого пола, округлив его до трёх знаков после запятой. Колонку с посчитанным средним значением назовите avg_cancel_rate.

Помните про отсутствие информации о поле некоторых пользователей после join, так как не все пользователи из таблицы user_action есть в таблице users. Для этой группы тоже посчитайте cancel_rate и в результирующей таблице для пустого значения в колонке с полом укажите ‘unknown’ (без кавычек). Возможно, для этого придётся вспомнить, как работает COALESCE.

Результат отсортируйте по колонке с полом пользователя по возрастанию.

Поля в результирующей таблице: sex, avg_cancel_rate

Эту метрику в разрезе пола можно посчитать разными способами, в нашем случае давайте посчитаем так:

1. Сначала высчитаем avg_cancel_rate для каждого юзера.

2. Теперь приджойним информацию о поле юзеров.

3. Усредним avg_cancel_rate  по полу и округлим до 3х знаков.

In [ ]:
sql = '''
with t1 as (select t.user_id,  
round((count(distinct order_id) 
filter (where t.action = 'cancel_order'))::decimal / count(distinct order_id), 3) as cancel_rate
from user_actions t 
group by t.user_id
order by t.user_id) 


select coalesce(u.sex, 'unknown') as sex, round(avg(t.cancel_rate), 3) as avg_cancel_rate
from t1 t
left join users u 
on t.user_id = u.user_id
group by u.sex
order by u.sex
'''

In [ ]:
select(sql)

##17 задача

In [ ]:
sql = '''with t1 as (select o.order_id, ca.time - o.creation_time as deliver_time
from orders o 
left join courier_actions ca 
on o.order_id = ca.order_id
where ca.action = 'deliver_order'
order by deliver_time desc
limit 10 )
select order_id from t1'''

In [ ]:
select(sql)

In [ ]:
#another solution
SELECT
  order_id
FROM
  orders
  LEFT JOIN (
    SELECT
      order_id,
      time
    FROM
      courier_actions
    WHERE
      action = 'deliver_order'
  ) AS t USING (order_id)
ORDER BY
  time - creation_time DESC
LIMIT
  10

##18 задача

In [ ]:
sql = '''with t1 as (select o.order_id, unnest(array[o.product_ids]) as prod_id
from orders o
)
select t.order_id, array_agg(p.name) as product_names
from t1 t 
left join products p 
on t.prod_id = p.product_id 
group by t.order_id'''

In [ ]:
select(sql)

##19 задача

Выясните, кто заказывал и доставлял самые большие заказы. Самыми большими считайте заказы с наибольшим числом товаров.

Выведите id заказа, id пользователя и id курьера. Также в отдельных колонках укажите возраст пользователя и возраст курьера. Возраст измерьте числом полных лет, как мы делали в прошлых уроках. Считайте его относительно последней даты в таблице user_actions — как для пользователей, так и для курьеров. Колонки с возрастом назовите user_age и courier_age. Результат отсортируйте по возрастанию id заказа.

Поля в результирующей таблице: order_id, user_id, user_age, courier_id, courier_age

In [ ]:
with 
max_time as(select max(time) as max_t from user_actions), 

t1 as (select order_id, array_length(product_ids, 1) as len_prod
from orders
where order_id not in (select order_id from user_actions where action = 'cancel_order')
order by len_prod desc),
t2 as (select ua.order_id, ua.user_id, date_part('year', age((select max_t from max_time), u.birth_date)) as user_age
from user_actions as ua
left join users u 
on ua.user_id = u.user_id
), 
t3 as (select t.order_id, t.courier_id, date_part('year', age((select max_t from max_time), c.birth_date)) as courier_age
from courier_actions t
left join couriers c
on t.courier_id = c.courier_id
where t.order_id in (select order_id from t2)
), 

t4 as (
select t.order_id, user_id, user_age
from t1 t 
left join t2 b
on t.order_id = b.order_id
where len_prod = (select max(len_prod) from t1)
)
select distinct t.order_id, t.user_id, t.user_age, a.courier_id, a.courier_age
 from t4 t
 left join t3 a 
on t.order_id = a.order_id 
order by order_id

#Оконные функции

##лекции

Посчитать количество заказов за день по пользователю

In [ ]:
sql = '''select user_id, date, daily_orders, 
sum(daily_orders) OVER(partition by user_id) as total_orders,
sum(daily_orders) OVER(partition by date) as total_orders_date
from 

(select user_id, time::DATE as date, count(order_id) as daily_orders
from
user_actions
where action = 'create_order'
group by user_id, date) t1'''

In [ ]:
select(sql)

       user_id        date  daily_orders  total_orders  total_orders_date
0            1  2022-08-24             1           4.0              146.0
1            2  2022-08-24             1           2.0              146.0
2            7  2022-08-24             1           5.0              146.0
3           12  2022-08-24             1          13.0              146.0
4           21  2022-08-24             1           7.0              146.0
...        ...         ...           ...           ...                ...
41521    19938  2022-09-08             1           1.0             5721.0
41522    13540  2022-09-08             1           3.0             5721.0
41523    18942  2022-09-08             2           3.0             5721.0
41524    15704  2022-09-08             2           3.0             5721.0
41525    19970  2022-09-08             1           1.0             5721.0

[41526 rows x 5 columns]

Посчитать среднюю цену и сравнить с ней все цены

In [ ]:
sql = '''
select product_id, price, name, AVG(price) OVER() as avg_price,
price > AVG(price) OVER()
from products
'''

In [ ]:
select(sql)

    product_id  price                     name  avg_price  ?column?
0            1    150                    сахар  133.54023      True
1            2     50  чай зеленый в пакетиках  133.54023     False
2            3     80      вода негазированная  133.54023     False
3            4     46                  леденцы  133.54023     False
4            5     15               кофе 3 в 1  133.54023     False
..         ...    ...                      ...        ...       ...
82          83     55                    вафли  133.54023     False
83          84     90                мандарины  133.54023     False
84          85    200                  варенье  133.54023      True
85          86     70            кофе холодный  133.54023     False
86          87    398                 телятина  133.54023      True

[87 rows x 5 columns]

Найти когда курьер вышел на работу(дата первого заказа)

In [ ]:
sql = '''
select courier_id, order_id, time, action,
min(time) OVER (partition by courier_id) as first_time
from courier_actions 
limit 100
'''

In [ ]:
select(sql)

,courier_id,order_id,time,action,first_time
0,1,98,2022-08-24 21:53:00,accept_order,2022-08-24 21:53:00
1,1,522,2022-08-25 10:51:00,accept_order,2022-08-24 21:53:00
2,1,522,2022-08-25 11:15:00,deliver_order,2022-08-24 21:53:00
3,1,2276,2022-08-26 18:19:00,accept_order,2022-08-24 21:53:00
4,1,2276,2022-08-26 18:41:00,deliver_order,2022-08-24 21:53:00
...,...,...,...,...,...
95,2,23162,2022-09-02 03:04:00,deliver_order,2022-08-24 20:47:00
96,2,59525,2022-09-08 23:59:00,deliver_order,2022-08-24 20:47:00
97,2,21633,2022-09-01 19:19:00,deliver_order,2022-08-24 20:47:00
98,2,32149,2022-09-03 18:52:00,deliver_order,2022-08-24 20:47:00
99,2,39655,2022-09-04 21:48:00,accept_order,2022-08-24 20:47:00

##Rank and LAG

In [ ]:
sql = '''
select user_id, order_id, time, 
rank() OVER(partition by user_id order by time) as order_number
from user_actions
where action = 'create_order'
limit 10
'''

In [ ]:
select(sql)

   user_id  order_id                time  order_number
0        1         1 2022-08-24 01:52:00             1
1        1      4683 2022-08-27 20:56:00             2
2        1     22901 2022-09-02 00:58:00             3
3        1     23149 2022-09-02 02:36:00             4
4        2         2 2022-08-24 06:37:00             1
5        2      7114 2022-08-28 18:11:00             2
6        3         3 2022-08-24 07:35:00             1
7        3      6735 2022-08-28 15:53:00             2
8        3     18137 2022-08-31 20:26:00             3
9        3     19793 2022-09-01 08:53:00             4

Сколько у пользователя было заказов сегодня и сколько вчера? Сколько заказов пользователей делает в разные дни и проследить зависимости

In [ ]:
sql ='''
select time::DATE as date, user_id, count(order_id) as daily_orders, 
rank() over(partition by user_id order by time::DATE) as active_day_number,
LAG(count(order_id), 1) over(partition by user_id order by time::DATE) as last_day_orders
from 
user_actions
group by 1, 2
limit 10
'''

In [ ]:
select(sql)

         date  user_id  daily_orders  active_day_number  last_day_orders
0  2022-08-24        1             1                  1              NaN
1  2022-08-27        1             1                  2              1.0
2  2022-09-02        1             2                  3              1.0
3  2022-08-24        2             1                  1              NaN
4  2022-08-28        2             1                  2              1.0
5  2022-08-24        3             1                  1              NaN
6  2022-08-28        3             1                  2              1.0
7  2022-08-31        3             1                  3              1.0
8  2022-09-01        3             1                  4              1.0
9  2022-08-24        4             1                  1              NaN

Вариант более читаемого решения

In [ ]:
sql = '''

select date, user_id, daily_orders, 
rank() over(partition by user_id order by date) as active_day_number,
LAG(daily_orders, 1) over(partition by user_id order by date) as last_day_orders
from 
(select time::DATE as date, user_id, count(order_id) as daily_orders
from 
user_actions
group by 1, 2) t1
limit 10
'''

In [ ]:
select(sql)

         date  user_id  daily_orders  active_day_number  last_day_orders
0  2022-08-24        1             1                  1              NaN
1  2022-08-27        1             1                  2              1.0
2  2022-09-02        1             2                  3              1.0
3  2022-08-24        2             1                  1              NaN
4  2022-08-28        2             1                  2              1.0
5  2022-08-24        3             1                  1              NaN
6  2022-08-28        3             1                  2              1.0
7  2022-08-31        3             1                  3              1.0
8  2022-09-01        3             1                  4              1.0
9  2022-08-24        4             1                  1              NaN